Revit 2025 API
RebarBendData.HookAngle1 Property
 The angle of the hook at the end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public int HookAngle1 { get; set; }
Public Property HookAngle1 As Integer
	Get
	Set
public:
property int HookAngle1 {
	int get ();
	void set (int value);
}
member HookAngle1 : int with get, set
Property Value
Int32
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace